<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>Slobodni softver u 2022. godini</title>
</head>
<body>
<h2 style="text-align: justify;" id="org85c51ba">Slobodni softver u 2022. godini</h2>
<div style="text-align: justify;">
</div>
<div style="text-align: justify;" class="outline-text-2" id="text-1">
<p>
Ideja Slobodnog softvera postoji jo&scaron; pre nego &scaron;to je Ri&#269;ard Stalman 
1985. godine napravio Fondaciju za Slobodan softver (eng. Free Software 
Foundation). Ovaj esej ima ulogu da pojasni za&scaron;to su ove ideje danas 
mo&#382;da jo&scaron; bitnije nego osamdesetih godina i da upozna &#269;itaoce sa 
konceptom i idejama koje stoje iza ideje &ldquo;Slobodnog softvera&rdquo;.
</p>


<p>
&Scaron;ta je to Slobodni softver?
</p>


<p>
Slobodni softver nije te&scaron;ko definisati, mo&#382;emo re&#263;i da je softver 
&ldquo;slobodan&rdquo; ako korisniku daje odre&#273;ene mogu&#263;nosti, tj. odre&#273;ene slobode:
 
</p>



<ul class="org-ul">
  <li>Sloboda 0. Slobodu pokretanja programa po va&scaron;oj &#382;elji, za bilo koju svrhu (sloboda broj 0).</li>
  <li>Sloboda 1. Slobodu prou&#269;avanja na&#269;ina rada programa i prilago&#273;avanja
 programa va&scaron;im potrebama (sloboda broj 1). Preduslov za ovo jeste 
obezbe&#273;ivanje pristupa izvornom kodu.</li>
  <li>Sloboda 2. Slobodu deljenja primeraka programa, kako biste mogli da pomognete bli&#382;njem (sloboda broj 2).</li>
  <li>Sloboda 3. Sloboda da delite kopije va&scaron;ih izmena drugima (sloboda 
broj 3). Rade&#263;i ovo dajete priliku da napreduje celoj zajednici kroz 
va&scaron;e izmene. Preduslov za ovo je pristup izvornom kodu.</li>
</ul>


<p>
Kao &scaron;to vidimo Slobodni softver je softver koji po&scaron;tuje prava i daje mogu&#263;nosti i
slobode korisniku softvera koje ostali na&#269;ini licenciranja softvera ne dozvoljavaju
(kao npr. Softver otvorenog koda (eng. Open Source Software)). Ovo ne zna&#269;i da je
softver besplatan, trik je u engleskom nazivu (eng. Free software) &scaron;to u bukvalnom
prevodu zna&#269;i besplatan, Slobodni softver se mo&#382;e napla&#263;ivati ali i kao takav on i
dalje po&scaron;tuje slobode svojih korisnika.
</p>


<p>
Za&scaron;to je Slobodan softver va&#382;an danas?
</p>


<p>
Svesni smo da su informacione tehnologije i digitalni aspekt dru&scaron;tva sve prisutniji
u na&scaron;im &#382;ivotima. Probajte da podignete platu bez kori&scaron;&#263;enja softvera, ili da idete
u &scaron;kolu u toku pandemije, da platite ra&#269;une. Sve ovo je sedamdesetih i osamdesetih
godina ve&#263; naslutio Ri&#269;ard Stalman. Zbog &#269;ega je on i dalje aktuelan, da li je on
mogao da predvidi sve &scaron;to se danas de&scaron;ava i &scaron;to &#263;e se u budu&#263;nosti de&scaron;avati.
Verovatno NE. Ali ono &scaron;to je bitno jeste da je on uvideo problem sa samim softverom
i sa mogu&#263;no&scaron;&#263;u da umesto da korisnik kontroli&scaron;e softver, softver kontroli&scaron;e korisnika.
Kompanije kao Meta, Epl, Majkrosoft, Tesla, Gugl, Amazon uvidele su da softver, ne samo
da mo&#382;e biti isplativ, ve&#263; i da mo&#382;e kontrolisati korisnike, njihovo pona&scaron;anje, kao i
sugestivno uticati na samo odlu&#269;ivanje korisnika. Te zbog toga &scaron;to je softver sve
prisutniji u na&scaron;im &#382;ivotima, Stalman postaje sve aktuelniji.
</p>


<p>
Kako softver koji nije slobodan ugro&#382;ava same korisnike i za&scaron;to je slobodni softver dru&scaron;tveno odgovoran?
</p>


<p>Softver koji nije slobodan mo&#382;e da ugrozi ljude samo ukoliko ga oni
koriste.
Ovo je naravno veoma sme&scaron;na re&#269;enica ali to je su&scaron;ta
istina. Ukoliko ne koristi&scaron;
softver koji nije slobodan onda ti on ne mo&#382;e nauditi. Naravno, ovo je
zbog digitalizacije i
modernih tehnologija sve te&#382;e i te&#382;e uraditi. Pogledajmo primer bilo
koje dr&#382;ave, ona gra&#273;anima
mo&#382;e omogu&#263;iti npr. softver koji slu&#382;i za glasanje, zakazivanje lekara,
pla&#263;anje ra&#269;una. Po&scaron;to gra&#273;ani
nemaju uvid u sam kod softvera i ne mogu da vide da li ih dr&#382;ava
ugro&#382;ava na bilo koji na&#269;in onda su i sami
gra&#273;ani ugro&#382;eni. Dozvolite da objasnim, ovde mo&#382;emo &#269;uti komentare da
gra&#273;anin treba da veruje svojoj dr&#382;avi,
ali ovo je klasi&#269;no izbegavanje same istine. Nije bitno da li dr&#382;ava
ugro&#382;ava gra&#273;ane, bitno je da ona to mo&#382;e da uradi,
jer joj to softver koji nije slobodan omogu&#263;ava. Naravno nije samo
dr&#382;ava korisnik softvera koji nije slobodan,
va&scaron;a banka je jedna od korisnika, va&scaron; prodavac itd. Tako
da sam softver prelazi iz polja digitalnog i ne&#269;eg
apstraktnog u samo polje dru&scaron;tva i dru&scaron;tvenih normi.
Softver uti&#269;e na dru&scaron;tvo i podsti&#269;e i oblikuje njegov razvoj.
</p>


<p></p>
<div style="text-align: center;">
<b>Slodobni softver je jedini dru&scaron;tveno odgovoran softver, i treba 
postati dru&scaron;tvena norma, slobodnom dru&scaron;tvu treba slobodan softver.</b></div>
<p>
</p>
</div>
</body>
</html>
